In [1]:
import pandas as pd
df = pd.read_csv("salaries_clean.csv")
df

,index,salary_id,employer_name,location_name,location_state,location_country,location_latitude,location_longitude,job_title,job_title_category,job_title_rank,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus,stock_value_bonus,comments,submitted_at
0,0,1,opower,"san francisco, ca",CA,US,37.77,-122.41,systems engineer,Engineering,NaN,13.0,2.0,125000.0,5000.0,0.0,5000 shares,Don't work here.,3/21/16 12:58
1,1,3,walmart,"bentonville, ar",AR,US,36.36,-94.20,senior developer,Software,Senior,15.0,8.0,65000.0,NaN,5000.0,"3,000",NaN,3/21/16 12:58
2,2,4,vertical knowledge,"cleveland, oh",OH,US,41.47,-81.67,software engineer,Software,NaN,4.0,1.0,86000.0,5000.0,6000.0,0,NaN,3/21/16 12:59
3,3,6,netapp,waltham,NaN,NaN,NaN,NaN,mts,Other,NaN,4.0,0.0,105000.0,5000.0,8500.0,0,NaN,3/21/16 13:00
4,4,12,apple,cupertino,NaN,NaN,NaN,NaN,software engineer,Software,NaN,4.0,3.0,110000.0,5000.0,7000.0,150000,NaN,3/21/16 13:02
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1650,1650,3289,sparkfun electronics,"boulder, co",CO,US,40.02,-105.25,junior software developer,Software,Junior,1.0,0.5,60500.0,0.0,800.0,0,NaN,3/23/16 8:24
1651,1651,3290,intel,europe,NaN,NaN,NaN,NaN,staff software enginer,Software,NaN,6.0,4.0,164000.0,0.0,20000.0,30000 USD,NaN,3/23/16 8:27
1652,1652,3293,$2bn valuation tech company,nyc,NaN,NaN,NaN,NaN,sr. frontend eng,Web,Senior,7.0,1.0,150000.0,0.0,0.0,0,NaN,3/23/16 8:41
1653,1653,3294,of maryland,"college park, md",MD,US,38.99,-76.93,scientific programmer (faculty research assist...,Applied Science,NaN,5.0,1.0,75000.0,NaN,NaN,NaN,NaN,3/23/16 8:43
1654,1654,3298,linkedin,sunnyvale,NaN,NaN,NaN,NaN,business analytics intern,Other,Intern,2.0,0.0,50.0,0.0,0.0,0,NaN,3/23/16 9:12

In [2]:
# Create a dataframe with only the categorical variables in the salary data

A = df.select_dtypes(include= ['object','category'])
B = df.select_dtypes(include= 'number')
print("Categorical Dataframe")
display(A.head())
print("\n\nNumerical Dataframe")
display(B.head())

Categorical Dataframe

,employer_name,location_name,location_state,location_country,job_title,job_title_category,job_title_rank,stock_value_bonus,comments,submitted_at
0,opower,"san francisco, ca",CA,US,systems engineer,Engineering,NaN,5000 shares,Don't work here.,3/21/16 12:58
1,walmart,"bentonville, ar",AR,US,senior developer,Software,Senior,"3,000",NaN,3/21/16 12:58
2,vertical knowledge,"cleveland, oh",OH,US,software engineer,Software,NaN,0,NaN,3/21/16 12:59
3,netapp,waltham,NaN,NaN,mts,Other,NaN,0,NaN,3/21/16 13:00
4,apple,cupertino,NaN,NaN,software engineer,Software,NaN,150000,NaN,3/21/16 13:02

Numerical Dataframe

,index,salary_id,location_latitude,location_longitude,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus
0,0,1,37.77,-122.41,13.0,2.0,125000.0,5000.0,0.0
1,1,3,36.36,-94.20,15.0,8.0,65000.0,NaN,5000.0
2,2,4,41.47,-81.67,4.0,1.0,86000.0,5000.0,6000.0
3,3,6,NaN,NaN,4.0,0.0,105000.0,5000.0,8500.0
4,4,12,NaN,NaN,4.0,3.0,110000.0,5000.0,7000.0

In [3]:
num = df.select_dtypes(include= 'number')
print("\n\nNumerical Dataframe")
display(num.head())

Numerical Dataframe

,index,salary_id,location_latitude,location_longitude,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus
0,0,1,37.77,-122.41,13.0,2.0,125000.0,5000.0,0.0
1,1,3,36.36,-94.20,15.0,8.0,65000.0,NaN,5000.0
2,2,4,41.47,-81.67,4.0,1.0,86000.0,5000.0,6000.0
3,3,6,NaN,NaN,4.0,0.0,105000.0,5000.0,8500.0
4,4,12,NaN,NaN,4.0,3.0,110000.0,5000.0,7000.0

In [4]:
# -- Create a dataframe with only the following job title: 'software designer', 'junior software engineer'.

A= df[df['job_title'].isin(['software designer', 'junior software engineer'])]
A

,index,salary_id,employer_name,location_name,location_state,location_country,location_latitude,location_longitude,job_title,job_title_category,job_title_rank,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus,stock_value_bonus,comments,submitted_at
813,813,1681,secret ag,zurich,NaN,NaN,NaN,NaN,junior software engineer,Software,Junior,3.0,1.0,92000.0,NaN,6000.0,NaN,NaN,3/21/16 15:38
892,892,1834,nokia,"ottawa, canada",NaN,CA,60.00,-95.00,software designer,Software,NaN,4.0,1.0,56000.0,0.0,0.0,0,NaN,3/21/16 16:23
1361,1361,2708,:),hong kong,NaN,HK,22.27,114.19,junior software engineer,Software,Junior,1.0,1.0,0.0,0.0,0.0,0,NaN,3/22/16 1:02

In [5]:
# -- Create a dataframe showing only the job title and the salary of all 'Software Developers' in california and Oklahoma.

B= [['job_title', 'annual_base_pay', 'location_state']]
B = df[(df['job_title'] == 'software developer') & (df['location_state'].isin(['CA', 'OK']))]
B

,index,salary_id,employer_name,location_name,location_state,location_country,location_latitude,location_longitude,job_title,job_title_category,job_title_rank,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus,stock_value_bonus,comments,submitted_at
152,152,364,ibm,"san diego, ca",CA,US,32.71,-117.16,software developer,Software,NaN,9.0,8.0,151000.0,15000.0,5000.0,5000,NaN,3/21/16 13:31
233,233,518,midstage startup,"san francisco, ca",CA,US,37.77,-122.41,software developer,Software,NaN,1.0,1.0,120000.0,0.0,12000.0,1000,NaN,3/21/16 13:41
844,844,1739,zillow group,"irvine, ca",CA,US,33.74,-117.76,software developer,Software,NaN,4.0,1.0,105000.0,2000.0,NaN,1227 RSUs,NaN,3/21/16 15:54

In [6]:
# -- Who is the highest paid : 'ceo' or 'senior backend engineer'?

a = df[['annual_base_pay', 'job_title']]
a = a.loc[a.job_title.isin(['ceo', 'senior backend enginee'])]
a.groupby("job_title")[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False)

           annual_base_pay
job_title
ceo              2191200.0

In [7]:
#  what job_title_category will advice me to venture into in the US

D = df[['location_country', 'job_title_category', 'job_title','annual_base_pay']]
D = df.loc[(df["location_country"] == 'US')]
D.groupby(['location_country','job_title_category', 'job_title'])[['annual_base_pay']].mean().sort_values(by= 'annual_base_pay', ascending= False).head(1)

                                                                            annual_base_pay
location_country job_title_category job_title
US               Other              professional ice hockey player, center        9250000.0

In [8]:
# - What is the mean average of 'senior backend engineer' salary
E = df[['job_title','annual_base_pay' ]]
E = df.loc[df['job_title'] == 'senior backend engineer']
E.groupby('job_title')['annual_base_pay'].mean()

job_title
senior backend engineer    145000.0
Name: annual_base_pay, dtype: float64

In [19]:
# -- Create a dataframe of data workers who earns an average salary within 90,000 and 50,000 in the US

F = df[["job_title_category", "annual_base_pay"]]
F = df.loc[(df["job_title_category"] == "Data") &   (df["annual_base_pay"].between(50000, 90000))]
F

,index,salary_id,employer_name,location_name,location_state,location_country,location_latitude,location_longitude,job_title,job_title_category,job_title_rank,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus,stock_value_bonus,comments,submitted_at
13,13,34,small b2b company,minneapolis,NaN,NaN,NaN,NaN,analyst,Data,NaN,4.0,1.0,63000.00,0.0,2000.0,0,NaN,3/21/16 13:05
14,14,35,small b2b company,minneapolis,NaN,NaN,NaN,NaN,analyst,Data,NaN,4.0,1.0,63000.00,0.0,2000.0,0,NaN,3/21/16 13:05
22,22,48,nbc universal,new york,NY,US,38.00,-97.00,senior analyst,Data,Senior,2.0,1.5,55000.00,0.0,0.0,0,Dont go there,3/21/16 13:07
50,50,117,mckinsey & company,san francisco,NaN,NaN,NaN,NaN,business analyst,Data,NaN,1.5,1.5,90000.00,10000.0,22000.0,0,NaN,3/21/16 13:14
66,66,152,texas tech system,"lubbock, tx",TX,US,33.57,-101.87,programmer analyst iii,Data,3,7.0,3.0,55000.00,0.0,0.0,0,NaN,3/21/16 13:17
68,68,156,investment bank,"new york, ny",NY,US,40.71,-73.99,m&a analyst,Data,NaN,1.0,1.0,85000.00,15000.0,70000.0,0,Soul sucking,3/21/16 13:17
135,135,317,delaware north,"buffalo, ny",NY,US,42.88,-78.85,data visualization engineer,Data,NaN,3.0,0.0,80000.00,NaN,NaN,NaN,NaN,3/21/16 13:29
142,142,329,picwell,philadelphia,NaN,NaN,NaN,NaN,data scientist,Data,NaN,2.0,1.0,75000.00,0.0,0.0,0,NaN,3/21/16 13:30
156,156,368,goldman sachs,london,NaN,NaN,NaN,NaN,analyst (technology),Data,NaN,0.0,0.0,60000.00,13000.0,5000.0,0,Amounts converted from GBP to USD,3/21/16 13:32
164,164,388,digital agency,nyc,NaN,NaN,NaN,NaN,analyst,Data,NaN,3.0,2.0,80000.00,0.0,1000.0,0,NaN,3/21/16 13:33
237,237,523,city of college station,"college station, tx",TX,US,30.60,-96.31,systems analyst,Data,NaN,2.0,1.0,51000.00,0.0,0.0,0,NaN,3/21/16 13:42
271,271,583,telus,vancouver,NaN,NaN,NaN,NaN,business systems analyst,Data,NaN,4.0,3.0,60200.00,0.0,10.0,40% match on 6 percent you buy,NaN,3/21/16 13:45
378,378,828,medium sized isv,"montreal, quebec, canada",NaN,CA,60.00,-95.00,application analyst,Data,NaN,16.0,6.0,81500.00,0.0,3000.0,0,NaN,3/21/16 13:58
390,390,848,sacramento county,"sacramento, ca",CA,US,38.58,-121.49,it analyst i,Data,1,4.0,1.0,61000.00,0.0,0.0,0,NaN,3/21/16 14:01
450,450,978,startup,nyc,NaN,NaN,NaN,NaN,sr. ops analyst,Data,Senior,2.0,1.5,70000.00,0.0,0.0,0,NaN,3/21/16 14:10
468,468,1008,midsized company,midwest,NaN,NaN,NaN,NaN,data architect,Data,NaN,1.0,1.0,74000.00,0.0,3000.0,5000,NaN,3/21/16 14:13
471,471,1012,misc,halifax,NaN,NaN,NaN,NaN,data scientist,Data,NaN,1.0,1.0,55000.00,0.0,2000.0,0,NaN,3/21/16 14:13
511,511,1080,accenture,washington dc,WA,US,38.00,-97.00,analyst,Data,NaN,2.0,2.0,72000.00,5000.0,5000.0,1000,NaN,3/21/16 14:18
525,525,1106,kbc,belgium,NaN,BE,50.83,4.00,data scientist,Data,NaN,5.0,2.0,69000.00,0.0,5000.0,0,NaN,3/21/16 14:20
589,589,1261,placed,seattle,NaN,NaN,NaN,NaN,big data engineer,Data,NaN,1.0,0.0,68500.00,0.0,0.0,110,NaN,3/21/16 14:33
600,600,1280,agl energy,"melbourne, australia",NaN,AU,-27.00,133.00,analyst,Data,NaN,3.0,1.0,90000.00,0.0,10000.0,1000,NaN,3/21/16 14:35
649,649,1368,digitaslbi,new york city,NY,US,38.00,-97.00,senior analyst,Data,Senior,2.0,0.0,90000.00,0.0,0.0,0,NaN,3/21/16 14:45
787,787,1626,state of texas,"austin, tx",TX,US,30.26,-97.74,system analyst iii,Data,3,3.0,2.0,65000.00,0.0,0.0,0,I need to get into the private sector - very l...,3/21/16 15:30
816,816,1687,humana,"tampa, fl",FL,US,27.95,-82.48,technology business analyst,Data,NaN,NaN,7.0,60650.00,0.0,0.0,0,NaN,3/21/16 15:40
984,984,1995,small startup,atlanta,NaN,NaN,NaN,NaN,data scientist,Data,NaN,1.0,1.0,90000.00,0.0,0.0,NaN,NaN,3/21/16 17:30
1043,1043,2096,tripadvisor,singapore,NaN,SG,1.37,103.80,senior data scientist,Data,Senior,3.0,1.0,85000.00,0.0,15.0,33000,NaN,3/21/16 18:10
1062,1062,2140,pre-series-b transportation startup,los angeles,NaN,NaN,NaN,NaN,data engineer,Data,NaN,3.0,0.5,82500.00,1000.0,15000.0,0,28-years old; self-taught python programmer,3/21/16 18:27
1144,1144,2296,seven west media,australia,NaN,AU,-27.00,133.00,data analyst,Data,NaN,1.0,1.0,62000.00,0.0,6000.0,0,NaN,3/21/16 19:48
1188,1188,2365,accenture,"bloomington, il",IL,US,40.47,-88.97,senior business analyst,Data,Senior,6.0,6.0,70000.00,NaN,2000.0,NaN,NaN,3/21/16 20:25
1209,1209,2423,zappos,las vegas,NaN,NaN,NaN,NaN,product analyst,Data,NaN,3.0,1.0,70000.00,NaN,NaN,NaN,NaN,3/21/16 21:03
1470,1470,2924,healthcare system,"grand rapids, mi",MI,US,42.96,-85.65,application development analyst,Data,NaN,5.0,1.0,77000.00,0.0,500.0,0,NaN,3/22/16 4:58
1480,1480,2952,hvfcu,poughkeepsie,NaN,NaN,NaN,NaN,programmer analyst,Data,NaN,5.0,2.0,65000.00,0.0,3.0,0,NaN,3/22/16 5:24
1501,1501,2996,manitoba public insurance,"winnipeg, mb canada",NaN,CA,60.00,-95.00,analyst,Data,NaN,6.0,6.0,71174.93,0.0,0.0,0,NaN,3/22/16 6:02
1521,1521,3032,oklahoma,oklahoma city,OK,US,38.00,-97.00,programmer analyst,Data,NaN,10.0,4.0,60000.00,0.0,0.0,0,NaN,3/22/16 6:56

In [10]:
# -- Which country has the most paid Data job title 

G = df[['location_country', 'job_title_category', 'annual_base_pay', 'job_title']]
G = G.loc[df["job_title_category"] == 'Data']
G.groupby(['location_country', 'job_title_category', 'job_title'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False).head(1)

                                                          annual_base_pay
location_country job_title_category job_title
US               Data               senior data engineer         145000.0

In [11]:
# -- What is the job_title name is the least paid in the US.
H = df[['job_title', 'location_country', 'annual_base_pay']]
H = H.loc[df["location_country"]== 'US']
H.groupby(['location_country',  'job_title'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = True).head(1)

                            annual_base_pay
location_country job_title
US               founder                0.0

In [20]:
# -- Create a dataframe of job_title_category who earns an average salary between 70,000 and 120,000 in the united states

I = df[["job_title_category", "annual_base_pay", "location_country"]]
I = df.loc[(df["location_country"] == "US") &   (df["annual_base_pay"].between(70000, 120000))]
I

,index,salary_id,employer_name,location_name,location_state,location_country,location_latitude,location_longitude,job_title,job_title_category,job_title_rank,total_experience_years,employer_experience_years,annual_base_pay,signing_bonus,annual_bonus,stock_value_bonus,comments,submitted_at
2,2,4,vertical knowledge,"cleveland, oh",OH,US,41.47,-81.67,software engineer,Software,NaN,4.0,1.0,86000.0,5000.0,6000.0,0,NaN,3/21/16 12:59
10,10,24,pensco trust company,"denver, co",CO,US,39.82,-105.10,senior software engineer,Software,Senior,10.0,1.5,120000.0,0.0,6000.0,0,NaN,3/21/16 13:04
26,26,59,quick left,boulder co,CO,US,38.00,-97.00,senior developer,Software,Senior,6.0,1.0,120000.0,0.0,0.0,500,NaN,3/21/16 13:08
30,30,69,mitsubishi hitachi power systems america,"orlando, florida",FL,US,28.50,-81.37,steam turbine service engineer,Engineering,NaN,4.0,1.0,80001.0,10000.0,NaN,NaN,$10k was relocation.,3/21/16 13:10
31,31,70,startup,"detroit, mi",MI,US,42.38,-83.10,senior engineer,Engineering,Senior,8.0,3.0,100000.0,0.0,0.0,80000,NaN,3/21/16 13:10
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1622,1622,3228,microsoft,"redmond, wa",WA,US,47.68,-122.12,intern,Other,Intern,2.0,1.0,90000.0,5000.0,0.0,0,"4000 In housing for the summer, and 1000 for t...",3/22/16 18:28
1632,1632,3243,tendril,"boulder, co",CO,US,40.02,-105.25,software engineer,Software,NaN,3.0,1.5,110000.0,2500.0,11000.0,NaN,"Stock options, unlimited PTO",3/22/16 21:17
1644,1644,3270,startup,"cambridge, ma",MA,US,42.35,-71.06,front end developer,Web,NaN,3.0,1.0,70000.0,NaN,NaN,3000,NaN,3/23/16 6:00
1647,1647,3278,comcast,"philadelphia, pa",PA,US,39.95,-75.16,software engineer,Software,NaN,6.0,2.5,111000.0,5000.0,8.0,~$2000,NaN,3/23/16 7:05
1653,1653,3294,of maryland,"college park, md",MD,US,38.99,-76.93,scientific programmer (faculty research assist...,Applied Science,NaN,5.0,1.0,75000.0,NaN,NaN,NaN,NaN,3/23/16 8:43

In [24]:
# -- Create a Create a dataframe of job_title_category who earns an average salary between 120,000 and and 200,000, and show the employer name of the highest paying company.

I = df[["job_title_category", "annual_base_pay", "employer_name"]]
I = df.loc[df["annual_base_pay"].between(120000, 200000)]
I[["job_title_category", "annual_base_pay", "employer_name"]]

     job_title_category  annual_base_pay                employer_name
0           Engineering         125000.0                       opower
7              Software         135000.0                      knewton
10             Software         120000.0         pensco trust company
17                Other         131000.0             magento commerce
20             Software         150000.0        small consulting shop
...                 ...              ...                          ...
1635         Management         130000.0                    capgemini
1641           Software         132000.0    small mobile product shop
1648           Software         130000.0                     facebook
1651           Software         164000.0                        intel
1652                Web         150000.0  $2bn valuation tech company

[480 rows x 3 columns]

In [41]:
# -- Data or Software job title Category, who is most paid in the US? Find the mean pay of Data job 
J = df[['job_title_category', 'location_country', 'annual_base_pay']]
J = J.loc[((df['job_title_category'] == "Data") | (df['job_title_category'] == "Software")) & (df['location_country'] == "US")]
J.groupby(['location_country',  'job_title_category'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False)

                                     annual_base_pay
location_country job_title_category
US               Software              109410.336842
                 Data                   78558.928571

In [37]:
# -- Which job title name - inside the Data job title category, is the most paid in the US.
K = df[['job_title', 'location_country','job_title_category', 'annual_base_pay']]
K = K.loc[(df["location_country"]== 'US') & (df['job_title_category'] == "Data")]
K.groupby(['job_title', 'location_country', 'job_title_category'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False).head(1)

                                                          annual_base_pay
job_title            location_country job_title_category
senior data engineer US               Data                       145000.0

In [42]:
# -- Which country has the highest paid Software job title category.
L = df[['job_title', 'location_country','job_title_category', 'annual_base_pay']]
L = L.loc[df['job_title_category'] == "Software"]
L.groupby(['job_title', 'location_country', 'job_title_category'])[['annual_base_pay']].mean().sort_values(by = 'annual_base_pay', ascending = False)

                                                                   annual_base_pay
job_title                     location_country job_title_category
software architect            HU               Software                  6000000.0
software development engineer IN               Software                  1200000.0
software developer            IN               Software                   950000.0
software engineer             PK               Software                   600000.0
experienced software engineer SE               Software                   510000.0
...                                                                            ...
php developer                 AR               Software                      900.0
contract software developer   CA               Software                       69.0
ios developer                 SE               Software                       36.5
developer                     PL               Software                       28.0
junior software engineer      HK               Software                        0.0

[180 rows x 1 columns]

In [61]:
# -- Create a dataframe that shows the location, job_title_category, and the employer name of: 'front-end developer', 'sr. engineering manager', 'staff software engineer', and 'senior data analyst'.
A = df[['job_title', 'job_title_category', 'location_country', 'employer_name']]
A = A.loc[df.job_title.isin(['front-end developer', 'sr. engineering manager', 'staff software engineer','senior data analyst'])]
A = A.groupby(['job_title','location_country', 'job_title_category', 'employer_name']).size().reset_index()
A[["job_title_category","employer_name"]]

  job_title_category                           employer_name
0                Web                               freelance
1                Web  mainz brady group - contractor at nike
2                Web                                netspend
3               Data                                 ad-tech
4           Software                                 mozilla
5           Software                                     box
6           Software                                     ibm